share/tutorials/incompressible/simple/pitz_daily_expt_inlet/system/controlDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      controlDict;
}

application     mousse-simple;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         1000;
deltaT          1;
writeControl    timeStep;
writeInterval   50;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;
functions
{
  streamLines
  {
    type            streamLine;
    // Where to load it from (if not already in solver)
    functionObjectLibs ("libmousse_field_function_objects.so");
    // Output every
    outputControl   outputTime;
    // outputInterval 10;
    setFormat       vtk; //gnuplot;//xmgr;//raw;//jplot;//csv;//ensight;
    // Velocity field to use for tracking.
    UName U;
    // Tracked forwards (+U) or backwards (-U)
    trackForward    true;
    // Names of fields to sample. Should contain above velocity field!
    fields (p k U);
    // Steps particles can travel before being removed
    lifeTime        10000;
    // Number of steps per cell (estimate). Set to 1 to disable subcycling.
    nSubCycle 5;
    // Cloud name to use
    cloudName       particleTracks;
    // Seeding method. See the sampleSets in sampleDict.
    seedSampleSet   uniform;  //cloud;//triSurfaceMeshPointSet;
    uniformCoeffs
    {
      type        uniform;
      axis        x;  //distance;
      start       (-0.0205 0.001  0.00001);
      end         (-0.0205 0.0251 0.00001);
      nPoints     10;
    }
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
