share/tutorials/incompressible/simple/pitz_daily_expt_inlet/0/epsilon
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      epsilon;
}

dimensions      [0 2 -3 0 0 0 0];
internalField   uniform 14.855;

boundaryField
{
  inlet
  {
    type            timeVaryingMappedFixedValue;
    setAverage      0;
    offset          0;
  }
  outlet
  {
    type            zeroGradient;
  }
  upperWall
  {
    type            epsilonWallFunction;
    value           uniform 14.855;
  }
  lowerWall
  {
    type            epsilonWallFunction;
    value           uniform 14.855;
  }
  frontAndBack
  {
    type            empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
