share/tutorials/incompressible/simple/pitz_daily_expt_inlet/system/fvSolution
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSolution;
}

solvers
{
  p
  {
    solver          GAMG;
    tolerance       1e-06;
    relTol          0.1;
    smoother        GaussSeidel;
    nPreSweeps      0;
    nPostSweeps     2;
    cacheAgglomeration on;
    agglomerator    faceAreaPair;
    nCellsInCoarsestLevel 10;
    mergeLevels     1;
  }
  "(U|k|epsilon|R|nuTilda)"
  {
    solver          smoothSolver;
    smoother        symGaussSeidel;
    tolerance       1e-05;
    relTol          0.1;
  }
}
SIMPLE
{
  nNonOrthogonalCorrectors 0;
  residualControl
  {
    p               1e-2;
    U               1e-3;
    "(k|epsilon|omega)" 1e-3;
  }
}
relaxationFactors
{
  fields
  {
    p               0.3;
  }
  equations
  {
    U               0.7;
    k               0.7;
    epsilon         0.7;
    R               0.7;
    nuTilda         0.7;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
